use cgv;

-- 장르 등록(최초 한번만 등록하면 됨)
insert into genre (ge_name) values('액션'),('어드벤처'),('스릴러');
insert into genre
	values('드라마'),('판타지'),('서부'),('공포'),('멜로/로맨스'),('느와르'),
    ('컬트'),('다큐멘터리'),('코미디'),('가족'),('미스터리'),('전쟁'),
    ('애니메이션'),('범죄'),('뮤지컬'),('무협'),('에로'),('서스펜스'),
    ('서사'),('블랙코미디'),('실험');
select * from genre;

-- 영화인을 등록(등록되지 않은 영화인이 나오는 경우 등록)
insert into movie_person(mp_name, mp_birth, mp_contry)
    values('제임스 카메론', '1954-08-16', '캐나다');
insert into movie_person(mp_name, mp_birth, mp_contry)
    values('조 샐다나', '1978-06-19', '미국'),
		  ('샘 워싱턴', '1976-08-02', '영국'),
		  ('시고니 위버', '1949-10-08', '미국');
 insert into movie_person(mp_name, mp_birth, mp_contry)
    values('우나 채플린', '1986-06-04', '-'),
		  ('지오바니 리비시', '1974-12-17', '미국'),
		  ('스티븐 랭', '1952-07-11', '미국'),
          ('케이트 윈슬렛', '1975-10-05', '영국');
select * from movie_person;

-- 영화를 등록
insert into movie (mo_title, mo_contents, mo_age, mo_run,
	mo_opening_date, mo_state) 
		values('아바타-물의 길', 
        '<아바타: 물의 길>은 판도라 행성에서 
		제이크 설리와 네이티리가 이룬 가족이 겪게 되는 무자비한 위협과 
		살아남기 위해 떠나야 하는 긴 여정과 전투, 
		그리고 견뎌내야 할 상처에 대한 이야기를 그렸다.',
        12, 192, '2022-12-14', '현재 상영중');
select * from movie;

-- 영화 장르 등록
insert into movie_genre(mg_ge_name, mg_mo_num)
	values('액션',1),('어드벤처', 1), ('sf', 1), ('스릴러', 1);
select * from movie_genre;

-- 영화 참여 등록
insert into movie_casting(mc_mp_num, mc_mo_num, mc_role)
	values(1, 1, '감독'),(2, 1, '배우'), (3, 1, '배우'),(4, 1, '배우');
insert into movie_casting(mc_mp_num, mc_mo_num, mc_role)
	values(5, 1, '배우'),(6, 1, '배우'), (7, 1, '배우'),(8, 1, '배우');
select * from movie_casting;

-- 트레일러 등록
drop table trailer;
insert into trailer(tr_title, tr_file_name, tr_mo_num)
	values('환상적인 판도라의 세계 영상', 'http://h.vod.cgv.co.kr:80/vodCGVa/86072/86072_210699_1200_128_960_540.mp4', '1');
select * from trailer;

-- 스틸컷 등록
insert into stillcut(st_file_name, st_mo_num)
	values('https://img.cgv.co.kr/Movie/Thumbnail/StillCut/000086/86072/86072210613_727.jpg',1);
select * from stillcut;

-- 지역 등록
insert into region (re_name) values('강남');
update region set re_name = '서울' where re_name = '강남';
insert into region (re_name) values('경기')('');
select * from region;

-- 극장 등록
insert into theater (th_name, th_lot_address, th_address, 
th_trans_info, th_parking_info, th_number, th_total_cinema, 
th_total_seat, th_re_name)
values('CGV강남', '서울특별시 강남구 역삼동 814-6 스타플렉스', 
'서울특별시 강남구 강남대로 438 (역삼동)','지하철 : 2호선 | 강남역 11번 출구',
'주차정보 - 위치: 건물 지하2F ~ 지하4F', '1544-1122', 6, 874, '서울' );
update theater set th_total_seat = 60 where th_total_seat = 874;
select * from theater;

-- 영화관 등록
insert into cinema(ci_name, ci_seat_count, ci_type, ci_th_num)
	values('1관 6층', 10, '2D', 1),('2관 6층(Laser)', 10, '2D', 1),
    ('3관 8층', 10, '3D', 1),('4관[SCREENX] 8층', 10, 'SCREENX 2D', 1),
    ('5관 10층', 10, '2D', 1),('6관 10층(Laser)', 10, '2D', 1);
select * from cinema;

/*
1관 좌석 배치
A1 A2 A3 A4
B1 B2 B3 B4
C1 C2
2관 좌석 배치
A1 A2
B1 B2
C1 C2
D1 D2
E1 E2
3관 좌석 배치
A1 A2 A3 A4 A5
B1 B2 B3 B4 B5
4관 좌석 배치
A1 A2 A3
B1 B2 B3
C1 C2 C3 C4
5관 좌석 배치
A1 A2 A3 A4
B1 B2 B3 B4
C1 C2
6관 좌석 배치
A1 A2 A3 A4
B1 B2 B3 B4
C1 C2
*/
-- 좌석 등록
insert into seat (se_name, se_state, se_ci_num, se_price)
	values('A1', '가능', 1, 10000),('A2', '가능', 1, 10000),
    ('A3', '가능', 1, 10000),('A4', '가능', 1, 10000),
    ('B1', '가능', 1, 10000),('B2', '가능', 1, 10000),
    ('B3', '가능', 1, 10000),('B4', '가능', 1, 10000),
    ('C1', '가능', 1, 10000),('C2', '가능', 1, 10000),
    ('A1', '가능', 2, 10000),('A2', '가능', 2, 10000),
    ('B1', '가능', 2, 10000),('B2', '가능', 2, 10000),
    ('C1', '가능', 2, 10000),('C2', '가능', 2, 10000),
	('D1', '가능', 2, 10000),('D2', '가능', 2, 10000),
	('E1', '가능', 2, 10000),('E2', '가능', 2, 10000),
    ('A1', '가능', 3, 10000),('A2', '가능', 3, 10000),
    ('A3', '가능', 3, 10000),('A4', '가능', 3, 10000),
    ('A5', '가능', 3, 10000),('B1', '가능', 3, 10000),
    ('B2', '가능', 3, 10000),('B3', '가능', 3, 10000),
	('B4', '가능', 3, 10000),('B5', '가능', 3, 10000),
    ('A1', '가능', 4, 10000),('A2', '가능', 4, 10000),
    ('A3', '가능', 4, 10000),('B1', '가능', 4, 10000),
    ('B2', '가능', 4, 10000),('B3', '가능', 4, 10000),
    ('C1', '가능', 4, 10000),('C2', '가능', 4, 10000),
	('C3', '가능', 4, 10000),('C4', '가능', 4, 10000),
    ('A1', '가능', 5, 10000),('A2', '가능', 5, 10000),
    ('A3', '가능', 5, 10000),('A4', '가능', 5, 10000),
    ('B1', '가능', 5, 10000),('B2', '가능', 5, 10000),
    ('B3', '가능', 5, 10000),('B4', '가능', 5, 10000),
    ('C1', '가능', 5, 10000),('C2', '가능', 5, 10000),
    ('A1', '가능', 6, 10000),('A2', '가능', 6, 10000),
    ('A3', '가능', 6, 10000),('A4', '가능', 6, 10000),
    ('B1', '가능', 6, 10000),('B2', '가능', 6, 10000),
    ('B3', '가능', 6, 10000),('B4', '가능', 6, 10000),
    ('C1', '가능', 6, 10000),('C2', '가능', 6, 10000);
select * from seat;

-- 상영시간 등록
insert into screen_schedule (ss_date, ss_time, ss_total_seat,
ss_possible_seat, ss_mo_num, ss_ci_num)
	values('2022-12-18', '10:30', 10, 10, 1, 4),
		  ('2022-12-18', '14:10', 10, 10, 1, 4),
          ('2022-12-18', '17:50', 10, 10, 1, 4),
		  ('2022-12-18', '21:30', 10, 10, 1, 4),
          ('2022-12-18', '10:30', 10, 10, 1, 1),
		  ('2022-12-18', '09:50', 10, 10, 1, 1),
          ('2022-12-18', '13:30', 10, 10, 1, 1),
		  ('2022-12-18', '17:10', 10, 10, 1, 1),
          ('2022-12-18', '19:00', 10, 10, 1, 2),
		  ('2022-12-18', '22:40', 10, 10, 1, 2),
          ('2022-12-18', '09:10', 10, 10, 1, 3),
		  ('2022-12-18', '12:50', 10, 10, 1, 3),
          ('2022-12-18', '16:30', 10, 10, 1, 3),
		  ('2022-12-18', '21:10', 10, 10, 1, 3),
          ('2022-12-18', '23:50', 10, 10, 1, 3),
		  ('2022-12-18', '08:30', 10, 10, 1, 5),
		  ('2022-12-18', '12:10', 10, 10, 1, 5),
          ('2022-12-18', '15:50', 10, 10, 1, 5),
		  ('2022-12-18', '19:30', 10, 10, 1, 5),
          ('2022-12-18', '23:10', 10, 10, 1, 5),
		  ('2022-12-18', '11:10', 10, 10, 1, 6),
          ('2022-12-18', '14:50', 10, 10, 1, 6),
		  ('2022-12-18', '18:30', 10, 10, 1, 6),
          ('2022-12-18', '22:10', 10, 10, 1, 6);
select * from screen_schedule;

-- 회원 등록
insert into member (me_id, me_pw, me_movie_count)
 values('abc', 'abc', 0);
select * from member;